# Computing Descriptive Statistics

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [4]:
df = DataFrame([[100, np.nan], [200, 300], [np.nan, np.nan], [-400, 10]],
              index=['a', 'b', 'c', 'd'],
              columns=["one", "two"])

In [5]:
df

     one    two
a  100.0    NaN
b  200.0  300.0
c    NaN    NaN
d -400.0   10.0

In [10]:
df.sum(axis=1, skipna=False)

a      NaN
b    500.0
c      NaN
d   -390.0
dtype: float64

In [14]:
df.describe().abs()

              one         two
count    3.000000    2.000000
mean    33.333333  155.000000
std    321.455025  205.060967
min    400.000000   10.000000
25%    150.000000   82.500000
50%    100.000000  155.000000
75%    150.000000  227.500000
max    200.000000  300.000000

In [35]:
frame = DataFrame(np.arange(15).reshape(5, 3),
                  index=list('abcde'),
                 columns=["one", "two", "three"])

In [36]:
frame

   one  two  three
a    0    1      2
b    3    4      5
c    6    7      8
d    9   10     11
e   12   13     14

In [37]:
frame.cumsum()

   one  two  three
a    0    1      2
b    3    5      7
c    9   12     15
d   18   22     26
e   30   35     40

In [45]:
frame.cumsum(axis=1)

   one  two  three
a    0    1      3
b    3    7     12
c    6   13     21
d    9   19     30
e   12   25     39

In [47]:
frame['sum'] = frame.sum(axis=1)

In [48]:
frame

   one  two  three  sum
a    0    1      2    6
b    3    4      5   24
c    6    7      8   42
d    9   10     11   60
e   12   13     14   78